In [10]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Informações do DataFrame

In [14]:
df.info() # Retorna os tipos de dadosdentro dos meus DataFrames

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [20]:
df.memory_usage() # Retorna a capacidade que está sendo consumida para otimização

Index    132
col1      32
col2      32
col3      32
dtype: int64

## Informações de valores exclusivos

In [26]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [38]:
df["col2"].unique() # Vai me retornar somente os valores da coluna especifica de forma única

array([444, 555, 666], dtype=int64)

In [42]:
df["col2"].nunique() # Retorna quantos valores únicos existem

3

In [58]:
df["col2"].value_counts() # Trás os dados das colunas sem repetição e quantas vezes eles se repetem

col2
444    2
555    1
666    1
Name: count, dtype: int64

## Aplicando funções

In [63]:
def comp(x):
    return x**2 +3

In [69]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
df["col1"].apply(comp) # O método apply permite aplicar sobre uma série de dados uma função

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [73]:
df["col1_calc"] = df["col1"].apply(comp) # Estou atribuindo a uma nova coluna os valores calculados em ['col1']
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [77]:
df['col1'].apply(lambda x: x**2 + 3) # Também é possível utilizar de funções lambda

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

## Operações matemáticas

In [82]:
df['col1'].sum() # Soma dos valores de uma coluna

10

In [86]:
df['col1'].mean() # A média

2.5

In [90]:
df['col1'].product() # Resultado de sua múltiplicação em sequência

24

In [92]:
df['col1'].std() # Desvio padrão

1.2909944487358056

In [94]:
df['col1'].max() # Retorna o valor máximo da Series/coluna

4

In [96]:
df['col1'].min() # Retorna o valor mínimo da Series/coluna

1

In [100]:
df['col1'].idxmax() # Retorna o índice onde está o maior valor da coluna

3

In [106]:
df[df['col2'] == 444]

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [104]:
df[df['col2'] == 444]['col1'].sum()

5

In [108]:
df.sort_values(by="col2")

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

## .map() e pivot_table()

In [110]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [112]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [114]:
dict_map = {"one": "1", "two": "2"}

In [123]:
df['E'] = df["B"].map(dict_map) # Utiliza de um dict para poder atribuir valores a uma Series
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [127]:
df.pivot_table(index="A", columns="B", values="D") # permite criar umo "novo" DataFrame com os dados do mesmo

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0